In [1]:
import sqlite3
import pandas as pd

In [2]:
# Create the connection
cnx = sqlite3.connect(r'kinara_assessment_20181008.db')

In [3]:
# create the dataframe from a query
df = pd.read_sql_query("SELECT * FROM loan_information", cnx)

In [4]:
df.head()

,loan_id,account_number,customer_id,enterprise_id,screening_date,product_code,hub_id
0,5692,TLMFS0000055,17850,6278,2017-03-07,TLMFS,46
1,6190,TLWCU0001219,17857,6280,2017-03-07,TLWCU,32
2,6191,TLAPS0000292,9481,2916,2017-03-07,TLAPS,32
3,6192,LCRIU0000019,6597,32,2017-03-10,LCRIU,32
4,6193,LCRIU0000020,9732,3167,2017-03-13,LCRIU,32

In [5]:
len(df.customer_id.unique())

2589

In [6]:
df.customer_id.value_counts().head()

24221    8
24277    4
6684     4
20437    3
6923     3
Name: customer_id, dtype: int64

In [7]:
df[df.customer_id==24221]

,loan_id,account_number,customer_id,enterprise_id,screening_date,product_code,hub_id
2401,11032,None,24221,8439,2017-05-22,None,35
2453,11084,None,24221,8439,2017-05-23,None,35
2473,11104,None,24221,8439,2017-05-24,None,35
2492,11123,None,24221,8439,2017-05-24,None,35
2505,11136,None,24221,8439,2017-05-24,None,35
2528,11159,None,24221,8439,2017-05-25,None,35
2582,11213,None,24221,8439,2017-05-26,None,35
2583,11214,None,24221,8439,2017-05-26,None,35

In [8]:
len(df.loan_id.unique())

2662

In [9]:
len(df.account_number.unique())

1548

In [10]:
df.shape

(2662, 7)

In [11]:
df.isnull().sum()

loan_id              0
account_number    1115
customer_id          0
enterprise_id        0
screening_date       0
product_code      1056
hub_id               0
dtype: int64

In [12]:
df1 = pd.read_sql_query("SELECT * FROM scores_information", cnx)

In [13]:
df1.head()

   loan_id ManagAgeui_APP BusinFormalityOfTheBusinessui ManagCBscoreui_APP
0     5692             32             Cash & Non Banked                  0
1     6190             35             Cash & Non Banked                  0
2     6191             32             Cash & Non Banked                  0
3     6193             39             Cash & Non Banked                548
4     8581             36             Cash & Non Banked                  0

In [14]:
df1.shape

(2033, 4)

In [15]:
df1.isnull().sum()

loan_id                           0
ManagAgeui_APP                   74
BusinFormalityOfTheBusinessui     2
ManagCBscoreui_APP               74
dtype: int64

In [16]:
df2 = pd.read_sql_query("SELECT * FROM enteprise_information", cnx)

In [17]:
df2.head()

   enterprise_id  business_type business_activity  business_sector
0              4  Manufacturing             Sales         Printing
1              7  Manufacturing  Job Work & Sales      Fabrication
2              8  Manufacturing  Job Work & Sales  Auto Components
3             16  Manufacturing  Job Work & Sales      Fabrication
4             19  Manufacturing             Sales          Leather

In [18]:
df2.shape

(2589, 4)

In [19]:
df2.isnull().sum()

enterprise_id        0
business_type        0
business_activity    0
business_sector      2
dtype: int64

In [20]:
df3 = pd.read_sql_query("SELECT * FROM disbursements_information", cnx)

In [21]:
df3.head()

  account_number  net_disbursement_magnitude transaction_Date
0   TLWCS0000594                    276196.0       2017-02-28
1   TLWCS0000609                    731482.0       2017-02-28
2   TLMFS0000046                    915017.0       2017-02-28
3   TLWCS0000656                    924979.0       2017-02-28
4   TLAPS0000238                   1343871.0       2017-02-28

In [22]:
df3.shape

(1575, 3)

In [23]:
df3.isnull().sum()

account_number                0
net_disbursement_magnitude    0
transaction_Date              0
dtype: int64

In [24]:
len(df3.account_number.unique())

1545

In [25]:
data= pd.merge(df,df1, how='left', on=['loan_id'])

In [26]:
data.head()

,loan_id,account_number,customer_id,enterprise_id,screening_date,product_code,hub_id,ManagAgeui_APP,BusinFormalityOfTheBusinessui,ManagCBscoreui_APP
0,5692,TLMFS0000055,17850,6278,2017-03-07,TLMFS,46,32,Cash & Non Banked,0
1,6190,TLWCU0001219,17857,6280,2017-03-07,TLWCU,32,35,Cash & Non Banked,0
2,6191,TLAPS0000292,9481,2916,2017-03-07,TLAPS,32,32,Cash & Non Banked,0
3,6192,LCRIU0000019,6597,32,2017-03-10,LCRIU,32,NaN,NaN,NaN
4,6193,LCRIU0000020,9732,3167,2017-03-13,LCRIU,32,39,Cash & Non Banked,548

In [27]:
data.shape

(2662, 10)

In [28]:
data.isnull().sum()

loan_id                             0
account_number                   1115
customer_id                         0
enterprise_id                       0
screening_date                      0
product_code                     1056
hub_id                              0
ManagAgeui_APP                    703
BusinFormalityOfTheBusinessui     631
ManagCBscoreui_APP                703
dtype: int64

In [29]:
data.BusinFormalityOfTheBusinessui.unique()

array(['Cash & Non Banked', nan, 'Invoice & Banked',
       'Invoice & Non Banked', 'Cash & Banked', None], dtype=object)

In [30]:
data1= pd.merge(data,df3, how='left', on=['account_number'])

In [31]:
data1.shape

(2692, 12)

In [32]:
data2= pd.merge(data1,df2, how='left', on=['enterprise_id'])

In [33]:
data2.shape

(2692, 15)

In [34]:
data2.isnull().sum()

loan_id                             0
account_number                   1115
customer_id                         0
enterprise_id                       0
screening_date                      0
product_code                     1056
hub_id                              0
ManagAgeui_APP                    705
BusinFormalityOfTheBusinessui     631
ManagCBscoreui_APP                705
net_disbursement_magnitude       1117
transaction_Date                 1117
business_type                       0
business_activity                   0
business_sector                     2
dtype: int64

In [35]:
data2.head(15)

,loan_id,account_number,customer_id,enterprise_id,screening_date,product_code,hub_id,ManagAgeui_APP,BusinFormalityOfTheBusinessui,ManagCBscoreui_APP,net_disbursement_magnitude,transaction_Date,business_type,business_activity,business_sector
0,5692,TLMFS0000055,17850,6278,2017-03-07,TLMFS,46,32,Cash & Non Banked,0,345909.0,2017-02-28,Manufacturing,Job Work,Auto Components
1,6190,TLWCU0001219,17857,6280,2017-03-07,TLWCU,32,35,Cash & Non Banked,0,144157.0,2017-02-28,Trading,Retail,Book Stores
2,6191,TLAPS0000292,9481,2916,2017-03-07,TLAPS,32,32,Cash & Non Banked,0,484931.0,2017-03-23,Manufacturing,Sales,Electricals
3,6192,LCRIU0000019,6597,32,2017-03-10,LCRIU,32,NaN,NaN,NaN,683859.0,2017-03-13,Manufacturing,Job Work & Sales,Auto Components
4,6193,LCRIU0000020,9732,3167,2017-03-13,LCRIU,32,39,Cash & Non Banked,548,896703.0,2017-03-15,Manufacturing,Job Work,Auto Components
5,8581,TLAPS0000238,17643,6209,2017-03-02,TLAPS,26,36,Cash & Non Banked,0,1343871.0,2017-02-28,Manufacturing,Job Work,Machine Components
6,8582,TLMFS0000046,7010,445,2017-03-02,TLMFS,84,48,Cash & Non Banked,0,915017.0,2017-02-28,Manufacturing,Sales,Auto Components
7,8583,TLWCS0000609,17638,6207,2017-03-02,TLWCS,36,NaN,NaN,NaN,731482.0,2017-02-28,Manufacturing,Sales,Machine Components
8,8584,TLAPS0000270,17639,6208,2017-03-02,TLAPS,32,35,Invoice & Banked,584,401225.0,2017-02-28,Manufacturing,Job Work,Auto Components
9,8585,TLWCS0000656,17662,6216,2017-03-02,TLWCS,29,61,Cash & Non Banked,0,924979.0,2017-02-28,Manufacturing,Sales,Machine Components
10,8586,TLWCS0000594,17665,6217,2017-03-02,TLWCS,11,33,Cash & Non Banked,0,276196.0,2017-02-28,Manufacturing,Sales,Wood
11,8587,LCRDS0000162,7815,1250,2017-03-02,LCRDS,15,47,Cash & Non Banked,0,583800.0,2017-02-28,Manufacturing,Sales,Wood
12,8588,None,17670,6218,2017-03-02,None,6,NaN,NaN,NaN,NaN,NaN,Trading,Retail,None
13,8590,None,17678,6220,2017-03-02,None,14,NaN,NaN,NaN,NaN,NaN,Manufacturing,Job Work,Auto Components
14,8591,ICWCS0000074,17687,6222,2017-03-02,ICWCS,14,47,Invoice & Banked,704,637848.0,2017-03-28,Manufacturing,Sales,Machine Components

In [36]:
data2.dtypes

loan_id                            int64
account_number                    object
customer_id                        int64
enterprise_id                      int64
screening_date                    object
product_code                      object
hub_id                             int64
ManagAgeui_APP                    object
BusinFormalityOfTheBusinessui     object
ManagCBscoreui_APP                object
net_disbursement_magnitude       float64
transaction_Date                  object
business_type                     object
business_activity                 object
business_sector                   object
dtype: object

In [37]:
data2.shape

(2692, 15)

In [38]:
import numpy as np

In [39]:
data2['account_number'].replace('None',np.nan,inplace=True)

In [40]:
data2.isnull().sum()

loan_id                             0
account_number                   1115
customer_id                         0
enterprise_id                       0
screening_date                      0
product_code                     1056
hub_id                              0
ManagAgeui_APP                    705
BusinFormalityOfTheBusinessui     631
ManagCBscoreui_APP                705
net_disbursement_magnitude       1117
transaction_Date                 1117
business_type                       0
business_activity                   0
business_sector                     2
dtype: int64

In [41]:
data2.head(15)

,loan_id,account_number,customer_id,enterprise_id,screening_date,product_code,hub_id,ManagAgeui_APP,BusinFormalityOfTheBusinessui,ManagCBscoreui_APP,net_disbursement_magnitude,transaction_Date,business_type,business_activity,business_sector
0,5692,TLMFS0000055,17850,6278,2017-03-07,TLMFS,46,32,Cash & Non Banked,0,345909.0,2017-02-28,Manufacturing,Job Work,Auto Components
1,6190,TLWCU0001219,17857,6280,2017-03-07,TLWCU,32,35,Cash & Non Banked,0,144157.0,2017-02-28,Trading,Retail,Book Stores
2,6191,TLAPS0000292,9481,2916,2017-03-07,TLAPS,32,32,Cash & Non Banked,0,484931.0,2017-03-23,Manufacturing,Sales,Electricals
3,6192,LCRIU0000019,6597,32,2017-03-10,LCRIU,32,NaN,NaN,NaN,683859.0,2017-03-13,Manufacturing,Job Work & Sales,Auto Components
4,6193,LCRIU0000020,9732,3167,2017-03-13,LCRIU,32,39,Cash & Non Banked,548,896703.0,2017-03-15,Manufacturing,Job Work,Auto Components
5,8581,TLAPS0000238,17643,6209,2017-03-02,TLAPS,26,36,Cash & Non Banked,0,1343871.0,2017-02-28,Manufacturing,Job Work,Machine Components
6,8582,TLMFS0000046,7010,445,2017-03-02,TLMFS,84,48,Cash & Non Banked,0,915017.0,2017-02-28,Manufacturing,Sales,Auto Components
7,8583,TLWCS0000609,17638,6207,2017-03-02,TLWCS,36,NaN,NaN,NaN,731482.0,2017-02-28,Manufacturing,Sales,Machine Components
8,8584,TLAPS0000270,17639,6208,2017-03-02,TLAPS,32,35,Invoice & Banked,584,401225.0,2017-02-28,Manufacturing,Job Work,Auto Components
9,8585,TLWCS0000656,17662,6216,2017-03-02,TLWCS,29,61,Cash & Non Banked,0,924979.0,2017-02-28,Manufacturing,Sales,Machine Components
10,8586,TLWCS0000594,17665,6217,2017-03-02,TLWCS,11,33,Cash & Non Banked,0,276196.0,2017-02-28,Manufacturing,Sales,Wood
11,8587,LCRDS0000162,7815,1250,2017-03-02,LCRDS,15,47,Cash & Non Banked,0,583800.0,2017-02-28,Manufacturing,Sales,Wood
12,8588,None,17670,6218,2017-03-02,None,6,NaN,NaN,NaN,NaN,NaN,Trading,Retail,None
13,8590,None,17678,6220,2017-03-02,None,14,NaN,NaN,NaN,NaN,NaN,Manufacturing,Job Work,Auto Components
14,8591,ICWCS0000074,17687,6222,2017-03-02,ICWCS,14,47,Invoice & Banked,704,637848.0,2017-03-28,Manufacturing,Sales,Machine Components

In [42]:
data2[data2.account_number.isnull()].head(5)

,loan_id,account_number,customer_id,enterprise_id,screening_date,product_code,hub_id,ManagAgeui_APP,BusinFormalityOfTheBusinessui,ManagCBscoreui_APP,net_disbursement_magnitude,transaction_Date,business_type,business_activity,business_sector
12,8588,None,17670,6218,2017-03-02,None,6,NaN,NaN,NaN,NaN,NaN,Trading,Retail,None
13,8590,None,17678,6220,2017-03-02,None,14,NaN,NaN,NaN,NaN,NaN,Manufacturing,Job Work,Auto Components
16,8594,None,17698,6226,2017-03-03,None,4,43,Cash & Non Banked,549,NaN,NaN,Manufacturing,Job Work & Sales,Fabrication
17,8596,None,17714,6232,2017-03-04,None,25,NaN,NaN,NaN,NaN,NaN,Manufacturing,Job Work & Sales,Auto Components
20,8600,None,17713,6231,2017-03-05,TLWCS,34,NaN,NaN,NaN,NaN,NaN,Manufacturing,Job Work & Sales,Machine Components

In [43]:
len(data2[data2.account_number.isnull()])

1115